{
  "home": {
    "title": "Adam Kascak - Artist/Designer",
    "3dGraphics": "3D Graphics",
    "graphicDesign": "Web Design",
    "illustrations": "Illustrations",
    "aboutMe": "About Me",
    "services": "Services"
  },
  "navbar": {
    "3dGraphics": "3D Graphics",
    "graphicDesign": "Web Design",
    "illustrations": "Illustrations",
    "aboutMe": "About Me",
    "services": "Services"
  },
  "contactCTA": "Contact",
  "graphicsLinks": {
    "SD": {
      "title": "Substance Designer Practice",
      "alt": "Render of rock material created using Substance Designer",
      "text": "Here are some of the materials I created using Substance Designer. The aim of this practice was to improve my skills in Substance Designer."
    },
    "FBU": {
      "title": "Forgotten but Unbroken",
      "alt": "Screenshot of enemy camp from video game Forgotten but Unbroken",
      "text": "Screenshots of maps I worked on during my time at Centurion Developments. I was part of the team developing Forgotten but Unbroken, a turn-based strategy game set during the events of World War II."
    },
    "Oasis": {
      "title": "Oasis",
      "alt": "Screenshot of oasis 3D environment",
      "text": "Another personal project I created in my free time. This time, I wanted to do something more stylized with a focus on organic elements like rocks and vegetation."
    },
    "Tomb": {
      "title": "Greek Tomb",
      "alt": "Screenshot of greek tomb 3D environment",
      "text": "A Greek tomb environment I created in my free time."
    },
    "more": "Read more on Artstation"
  },
  "designLinks": {
    "Portfolio": {
      "title": "Portfolio Website",
      "alt": "Web icon of Adam Kascak's portfolio website",
      "textShort": "Personal project. I wanted to make a website showcasing some of my work from different areas of visual arts.",
      "type": "Web Design",
      "tools": "Design: Figma, Krita, Adobe Illustrator \n Programming: React, Tailwind CSS",
      "year": "2025",
      "text": "Personal project. I wanted to make a website showcasing some of my work from different areas of visual arts. I also wanted this website to combine my love for illustrating, so of course simple angular illustrations were used on the home page. I wanted to keep the color palette black and white, as I also like to work mostly with black and white for most of my illustrations. There are a total of 4 colors used on this website: white, light grey, dark grey, and black.\nFonts used are all geometric sans-serif. Circular shapes of Montserrat Alternates complement nicely with sharp edges of illustrations and rectangles on the website. In some places, I also used Futura PT, this time for sharp edges on some of its symbols, like A and F.\nThe website was created by me from start to finish, including web development. I used the React framework with Tailwind CSS, as this is the combination I'm most comfortable with.",
      "images": [
        {
          "title": "Illustration Showcase",
          "alt": "Showcase of light and dark variations of illustrations used in portfolio website"
        },
        {
          "title": "Fonts Showcase",
          "alt": "Showcase of fonts used in portfolio website"
        },
        {
          "title": "Color Palette",
          "alt": "Showcase of 4 colors used across the portfolio website"
        }
      ]
    },
    "Horn": {
      "title": "Horn Box Gym Website",
      "alt": "Web icon of website of boxing studio in Bratislava",
      "textShort": "Fully responsive and accessible website of fictional boxing gym based in Bratislava.",
      "type": "Web Design",
      "tools": "Design: Figma, Adobe Illustrator \n Programming: HTML, CSS, Javascript",
      "year": "2025",
      "text": "H is a fictional fitness brand built around the spirit of boxing, martial arts, and conditioning training. The goal was to capture the raw energy and discipline of combat sports while keeping the brand approachable and inspiring for everyday athletes The design concept emphasizes boldness and strength while maintaining an approachable and friendly look — powerful but not intimidating. The logo, featuring a stylized bull’s skull, is rounded and simplified to convey energy and determination without aggression. Angled elements are used throughout the layout to enhance a sense of motion and dynamism. The landing page includes the following sections:  Home Banner | Equipment | Trainings | Prices | Instructors | Reviews | Gallery | Footer The design was created in Figma and developed using HTML5, CSS, and JavaScript, with a strong focus on responsive design across all devices, SEO optimization, and accessibility.",
      "images": [
        {
          "title": "Thumbnail",
          "alt": "Thumbnail of website of boxing studio"
        },
        {
          "title": "Colors Showcase",
          "alt": "Showcase of colors used in website"
        },
        {
          "title": "Logo Showcase",
          "alt": "Showcase of logo"
        },
        {
          "title": "Logo Showcase",
          "alt": "Showcase of logo"
        },
        {
          "title": "Logo Showcase",
          "alt": "Showcase of logo in dynamic lighting"
        },
        {
          "title": "Wireframe in Figma",
          "alt": "Wireframe in Figma"
        },
        {
          "title": "Full Desktop version",
          "alt": "Desktop Version"
        },
        {
          "title": "Mobile version",
          "alt": "Mobile Version"
        }
      ]
    },
    "Torse": {
      "title": "Torse Animation Landing Page",
      "alt": "Thumbnail of black and white interior design studio",
      "textShort": "Fully responsive and accessible website of fictional interior design studio using modern animations",
      "type": "Web Design",
      "tools": "Design: Figma, Photoshop, Blender \n Programming: React, Tailwind, GSAP",
      "year": "2025",
      "text": "Torse — Interior Design Studio Landing Page A sleek and high-contrast web landing page concept for a fictional interior design studio. The design emphasizes bold minimalism, featuring a black-and-white color palette and League Spartan typography to convey modernity and strength. Design created in Figma. Developed with React, Tailwind CSS, and GSAP for smooth, dynamic animations. Hero Visual: Rendered in Blender using Freestyle for a stylized, architectural illustration look. Video showcasing the process by Transient at Large is available on Youtube: https://www.youtube.com/watch?v=LElPE7R7Ka0 Explore the live page on GitHub Pages:: https://adammkass.github.io/torse/ ",
      "images": [
        {
          "title": "Thumbnail",
          "alt": "Thumbnail of website of interior design studio"
        },
        {
          "title": "Desktop version",
          "alt": "Desktop Version"
        },
        {
          "title": "Desktop Loading",
          "alt": "Desktop Loading Animation"
        },
        {
          "title": "Mobile version",
          "alt": "Mobile Version"
        },
        {
          "title": "Wireframe in Blender",
          "alt": "Wireframe view of interior in Blender"
        },
        {
          "title": "Shading",
          "alt": "Showcase of Black and White shading in Blender"
        }
      ]
    },
    "ScrollLock": {
      "title": "ScrollLock Parallax effect",
      "alt": "Thumbnail of modern landing pages of coffee shop and streetwear fashion brand",
      "textShort": "Fully responsive modern websites using sleek parallax scrolling to achieve scrolllock effect.",
      "type": "Web Design",
      "tools": "Design: Figma \n Programming: React, Tailwind, GSAP, Motion, Lenis",
      "year": "2025",
      "text": "Two landing pages using two animation libraries, GSAP an Motion achieving same effect in two versions. Obne version is horizontall slider and other one is vertical scrolling with snap. ",
      "images": [
        {
          "title": "Cof Desktop View",
          "alt": "Desktop view"
        },
        {
          "title": "Cof Desktop View",
          "alt": "Desktop View"
        },

        {
          "title": "Virignon Desktop View",
          "alt": "Desktop View"
        },
        {
          "title": "Virignon Landscape View",
          "alt": "Landcsape"
        }
      ]
    },
    "type": "Project Type",
    "tools": "Tools",
    "year": "Year",
    "more": "Read more"
  },
  "illustrationLinks": {
    "kohut": {
      "title": "Roosters in Key West",
      "alt": "Pen and ink illustration of a rooster",
      "text": "pen and ink, Letter"
    },
    "surfer": {
      "title": "Feel the Waves",
      "alt": "Digital black and white illustration of a surfer riding the waves",
      "text": "digital, 1920x1080p"
    },
    "shoes": {
      "title": "Shoes",
      "alt": "Pen and ink illustration of shoes on wooden floor",
      "text": "pen and ink"
    },
    "raven": {
      "title": "Raven",
      "alt": "Pen and ink illustration of raven sitting on branch",
      "text": "pen and ink"
    },
    "bird": {
      "title": "Bird",
      "alt": "Engraving of bird sitting on branch",
      "text": "Engraving"
    },
    "stillLife1": {
      "title": "Still Life Practice 1",
      "alt": "Charcoal study of several cups of different shapes and tablecloth",
      "text": "charcoal, pencil"
    },
    "stillLife2": {
      "title": "Still Life Practice 2",
      "alt": "Charcoal study of chair with several objects on top",
      "text": "charcoal, pencil"
    },
    "stillLife3": {
      "title": "Still Life Practice 3",
      "alt": "Charcoal study of porcelain elephant",
      "text": "charcoal, pencil"
    },
    "stillLife4": {
      "title": "Still Life Practice 4",
      "alt": "Charcoal study of glass jars and brushes",
      "text": "charcoal, pencil"
    }
  },

  "about": {
    "intro": "My name is Adam Kaščák. I'm a freelance web developer and designer based in Nitra, SLovakia. I focus on designing and creating modern and professional websites.",
    "hobbies": "With background in both 3D graphics and illustration, I enjoy blending 3D models or hand-painted artwork with web design",
    "alt": "Adam Kascak smiling in front of sailing ship",
    "experienceTitle": "Experience",
    "SD": {
      "title": "Substance Designer Practice",
      "alt": "Render of rock material created using Substance Designer",
      "text": "Here are some of the materials I created using Substance Designer. The aim of this practice was to improve my skills in Substance Designer."
    },
    "experience": {
      "exe": {
        "company": "exe a.s.",
        "role": "DTP Specialist",
        "time": "May 2025 - Present"
      },
      "centurion": {
        "company": "Centurion Developments",
        "role": "Junior Level Designer / 3D Artist",
        "time": "January 2024 - August 2024"
      }
    }
  },
  "services": {
    "title": "Services",
    "description": "Develop your passion project with eye catching branding, packaging, web design & illustrations.",
    "services": {
      "web": {
        "title": "Web Design and Development",
        "areas": "Wireframing - UI Design - Prototyping - Development",
        "about": "I can redesign or design brand new landing page for your brand and implement it using modern tools, such as Motion, Tailwind or GSAP"
      },
      "3d": {
        "title": "3D Assets and Environment Art",
        "areas": "Modeling - Texturing - Optimization - Vegetation - Architecture",
        "about": "I have skills to create 3D assets from scratch to finish, including optimization and lighting in scene. I specialise mostly on props, modular architecture and nature props."
      },
      "illustration": {
        "title": "Illustrations",
        "areas": "Vector - Infographics - Portraits - Ink",
        "about": "I can create simple yet striking icons and vector graphics, or I can create traditional illustrations, mostly focusing on portraits and architecture."
      }
    },
    "getInTouch": "If you're interested in working together, feel free to contact me.",
    "getInTouchButton": "Contact Me"
  },
  "footer": {
    "rights": "©2025 Adam Kascak. All Rights Reserved"
  },

  "notFound": {
    "error": "404 - Page not Found",
    "return": "Return to Homepage"
  }
}
