{
  "home": {
    "title": "Adam Kaščák - Freelance Umelec",
    "3dGraphics": "3D Grafika",
    "graphicDesign": "Grafický Dizajn",
    "illustrations": "Ilustrácie",
    "aboutMe": "O Mne"
  },
  "navbar": {
    "3dGraphics": "3D Grafika",
    "graphicDesign": "Grafický Dizajn",
    "illustrations": "Ilustrácie",
    "aboutMe": "O Mne",
    "contact": "Kontakt"
  },
  "graphicsLinks": {
    "SD": {
      "title": "Substance Designer Prax",
      "alt": "Render materiálu skaly vytvoreného pomocou Substance Designer",
      "text": "Tu sú niektoré z materiálov, ktoré som vytvoril pomocou Substance Designer. Cieľom tohto tréningu bolo zlepšiť moje zručnosti v Substance Designeri. Chcel som dosiahnuť viac štylizovaný vzhľad. Textúry boli vytvorené v Substance Designeri a finálny render bol urobený pomocou Substance Stagera."
    },
    "FBU": {
      "title": "Forgotten but Unbroken",
      "alt": "Screenshot nepriateľského tábora z videohry Forgotten but Unbroken",
      "text": "Screenshoty máp, na ktorých som pracoval počas môjho pôsobenia v Centurion Developments. Bol som súčasťou tímu vyvíjajúceho Forgotten but Unbroken, ťahovú strategickú hru zasadenú do udalostí druhej svetovej vojny."
    },
    "Oasis": {
      "title": "Oáza",
      "alt": "Screenshot 3D prostredia oázy",
      "text": "Ďalší osobný projekt, ktorý som vytvoril vo svojom voľnom čase. Tentokrát som chcel urobiť niečo viac štylizované so zameraním na organické prvky, ako sú skaly a vegetácia."
    },
    "Tomb": {
      "title": "Grécka Hrobka",
      "alt": "Screenshot gréckeho 3D prostredia hrobky",
      "text": "Grécke prostredie hrobky, ktoré som vytvoril vo svojom voľnom čase."
    },
    "more": "Prečítajte si viac na Artstation"
  },
  "designLinks": {
    "Portfolio": {
      "title": "Portfólio Webstránka",
      "alt": "Webová ikona portfóliovej webstránky Adama Kaščáka",
      "textShort": "Osobný projekt. Chcel som vytvoriť webstránku, ktorá by prezentovala niektoré z mojich prác z rôznych oblastí vizuálneho umenia.",
      "type": "Web Dizajn",
      "tools": "Dizajn: Figma, Krita, Adobe Illustrator \n Programovanie: React, Tailwind CSS",
      "year": "2025",
      "text": "Osobný projekt. Chcel som vytvoriť webstránku, ktorá by prezentovala niektoré z mojich prác z rôznych oblastí vizuálneho umenia. Tiež som chcel, aby táto webstránka kombinovala moju lásku k ilustrovaniu, takže som na domovskej stránke použil jednoduché uhlové ilustrácie. Chcel som zachovať farebnú paletu čierno-bielu, pretože rád pracujem prevažne s čiernou a bielou pre väčšinu svojich ilustrácií. Na tejto webstránke sú použité celkovo 4 farby: biela, svetlo sivá, tmavo sivá a čierna.\nPoužité fonty sú všetky geometrické sans-serif. Kruhové tvary Montserrat Alternates pekne dopĺňajú ostré hrany ilustrácií a obdĺžnikov na webstránke. Na niektorých miestach som tiež použil Futura PT, tentokrát pre ostré hrany niektorých jeho symbolov, ako sú A a F.\nWebstránku som vytvoril od začiatku do konca vrátane webového vývoja. Použil som framework React s Tailwind CSS, pretože je to kombinácia, s ktorou som najviac pohodlný.",
      "images": [
        {
          "title": "Prezentácia Ilustrácií",
          "alt": "Prezentácia svetlých a tmavých variácií ilustrácií použitých na portfóliovej webstránke"
        },
        {
          "title": "Prezentácia Fontov",
          "alt": "Prezentácia fontov použitých na portfóliovej webstránke"
        },
        {
          "title": "Farebná Paleta",
          "alt": "Prezentácia 4 farieb použitých na portfóliovej webstránke"
        }
      ]
    },
    "Divers Lenses": {
      "title": "Webstránka Diver's Lenses",
      "alt": "Logo webstránky Diver's Lenses",
      "textShort": "Osobný projekt. Chcel som zlepšiť svoje zručnosti s Figma - hlavne s vytváraním wireframov rôznych stránok webstránky, nielen úvodnej stránky. Rozhodol som sa navrhnúť webstránku na prezentáciu množstva fotografií.",
      "type": "Web dizajn, wireframing",
      "tools": "Dizajn: Figma",
      "year": "2024",
      "text": "Osobný projekt. Chcel som zlepšiť svoje zručnosti s Figma - hlavne s vytváraním wireframov rôznych stránok webstránky, nielen úvodnej stránky. Túto webstránku som vytvoril po absolvovaní kurzu Vako Shviliho o dizajne webstránok. Rozhodol som sa navrhnúť webstránku na prezentáciu množstva fotografií. Zvolil som tému podvodnej fotografie, hlavne preto, že voda a potápanie sú mi blízke.\nFarby boli, samozrejme, spojené s morom - modré a zelené, ktoré sa postupne stmavujú pri posúvaní nadol, čím simulujú potápanie v mori. Jednoduchý font Noto Sans bol zvolený pre jeho menej formálny a prívetivý vzhľad.\nNavigačný panel obsahuje odkaz na samostatný blog, tlačidlá na registráciu a vyhľadávací panel na rýchle vyhľadávanie obrázkov alebo fotografov. Pre úvodný banner som mal nápad prezentovať jeden z obrázkov na webstránke, ktorý by sa menil v priebehu času. Pätička obsahuje podrobnejšie odkazy a odkazy na sociálne siete.\nStránky iné ako úvodná stránka zostali iba ako wireframe. Niektoré z týchto stránok zahŕňajú hlavnú stránku blogu, stránku príspevku na blogu, stránku s jednotlivými obrázkami, stránku na úpravu používateľa atď.\nKrásne podvodné fotografie pre úvodnú stránku boli použité z Unsplash.",
      "images": [
        {
          "title": "Dizajnové štýly",
          "alt": "Prezentácia farieb a variácií fontov použitých na webstránke"
        },
        {
          "title": "Úvodná stránka - Desktop",
          "alt": "Desktopová verzia úvodnej stránky s podvodnými fotografiami"
        },
        {
          "title": "Úvodná stránka - Mobil",
          "alt": "Mobilná verzia úvodnej stránky s podvodnými fotografiami"
        },
        {
          "title": "Stránka blogu - Desktop",
          "alt": "Wireframe desktopovej verzie hlavnej stránky blogu"
        },
        {
          "title": "Stránka príspevku na blogu - Desktop",
          "alt": "Wireframe desktopovej verzie stránky príspevku na blogu"
        },
        {
          "title": "Stránka obrázku - Desktop",
          "alt": "Wireframe desktopovej verzie stránky na prezentáciu obrázku"
        },
        {
          "title": "Stránka obrázku - Mobil",
          "alt": "Wireframe mobilnej verzie stránky na prezentáciu obrázku"
        },
        {
          "title": "Stránka používateľa - Desktop",
          "alt": "Wireframe desktopovej verzie stránky zobrazujúcej prihláseného používateľa"
        },
        {
          "title": "Stránka na úpravu používateľa - Desktop",
          "alt": "Wireframe desktopovej verzie stránky s možnosťami na úpravu profilu používateľa"
        }
      ]
    },
    "type": "Typ Projektu",
    "tools": "Nástroje",
    "year": "Rok",
    "more": "Prečítajte si viac"
  },
  "illustrationLinks": {
    "kohut": {
      "title": "Kohúty v Key West",
      "alt": "Ilustrácia perom a atramentom kohúta",
      "text": "pero a atrament, Letter"
    },
    "surfer": {
      "title": "Cíťte Vlny",
      "alt": "Digitálna čierno-biela ilustrácia surfera na vlnách",
      "text": "digitálne, 1920x1080p"
    },
    "shoes": {
      "title": "Topánky",
      "alt": "Ilustrácia perom a atramentom topánok na drevenej podlahe",
      "text": "pero a atrament"
    },
    "raven": {
      "title": "Havran",
      "alt": "Ilustrácia perom a atramentom havrana sediaceho na vetve",
      "text": "pero a atrament"
    },
    "bird": {
      "title": "Vták",
      "alt": "Rytina vtáka sediaceho na vetve",
      "text": "Rytina"
    },
    "stillLife1": {
      "title": "Cvičenie Zátišia 1",
      "alt": "Štúdia uhlíkom niekoľkých šálok rôznych tvarov a obrus",
      "text": "uhlie, ceruzka"
    },
    "stillLife2": {
      "title": "Cvičenie Zátišia 2",
      "alt": "Štúdia uhlíkom stoličky s niekoľkými objektmi na vrchu",
      "text": "uhlie, ceruzka"
    },
    "stillLife3": {
      "title": "Cvičenie Zátišia 3",
      "alt": "Štúdia uhlíkom porcelánového slona",
      "text": "uhlie, ceruzka"
    },
    "stillLife4": {
      "title": "Cvičenie Zátišia 4",
      "alt": "Štúdia uhlíkom sklenených nádob a štetcov",
      "text": "uhlie, ceruzka"
    }
  },
  "about": {
    "intro": "Volám sa Adam Kaščák. Som nadšený pre rôzne oblasti spojené s grafikou a počítačmi. Mám titul z informatiky a predchádzajúce skúsenosti ako 3D umelec, ale moje ďalšie oblasti odbornosti zahŕňajú grafický dizajn, webový vývoj a ilustrácie.",
    "hobbies": "Keď nepracujem, rád sledujem animované filmy alebo čítam rôzne ilustrované knihy. Kedykoľvek mám príležitosť, rád plávam, potápam sa alebo trávim čo najviac času pri mori.",
    "alt": "Adam Kaščák sa usmieva pred plachetnicou"
  },
  "footer": {
    "rights": "©2025 Adam Kaščák. Všetky práva vyhradené"
  },
  "notFound": {
    "error": "404 - Stránka sa nenašla",
    "return": "Vrátiť sa na Domovskú Stránku"
  }
}
